public/jvm/scala/implicits.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 13:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org287c25f">1. Implicits</a>
<ul>
<li><a href="#orgd8ab444">1.1. Implicit conversion</a></li>
<li><a href="#org3005ad6">1.2. Implicit parameters</a></li>
<li><a href="#org2dff688">1.3. View bounds</a></li>
<li><a href="#org46d51c2">1.4. Context Bounds</a></li>
<li><a href="#org883ee30">1.5. Order of precedence for implicits</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org287c25f" class="outline-2">
<h2 id="org287c25f"><span class="section-number-2">1</span> Implicits</h2>
<div class="outline-text-2" id="text-1">
<p>
An implicit could be an "ambient" value for some scope or a conversion which can be applied automatically (implicitly :)).
</p>
</div>

<div id="outline-container-orgd8ab444" class="outline-3">
<h3 id="orgd8ab444"><span class="section-number-3">1.1</span> Implicit conversion</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Example:
</p>

<pre class="example">
"abc".map(_.toString)
</pre>

<p>
`String` does not support a `map` operation, but `StringOps` does - and if there exists a conversion from `String` to `StringOps`, then the example code will compile and work as expected.
</p>
</div>
</div>

<div id="outline-container-org3005ad6" class="outline-3">
<h3 id="org3005ad6"><span class="section-number-3">1.2</span> Implicit parameters</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Implicit parameters work just like normal ones, except for that the compiler tries to fill them in automatically - if it cannot, it will throw an error.
</p>

<p>
Example:
</p>
<pre class="example">
def foo[T](t: T)(implicit integral: Integral[T]) {println(integral)}
</pre>
</div>
</div>

<div id="outline-container-org2dff688" class="outline-3">
<h3 id="org2dff688"><span class="section-number-3">1.3</span> View bounds</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In the following example, an implicit value acts both as an implicit conversion and an implicit parameter:
</p>

<pre class="example">
def getIndex[T, CC](seq: CC, value: T)(implicit conv: CC =&gt; Seq[T]) = seq.indexOf(value)

getIndex("abc", 'a')
</pre>

<p>
This function can receive any objects as `seq` and `value` as long as an appropriate conversion exists.
</p>

<p>
This pattern is <b>very useful</b>, to the point of having syntactic sugar of <b>view bounds</b> for it:
</p>

<pre class="example">
def getIndex[T, CC &lt;% Seq[T]](seq: CC, value: T) = seq.indexOf(value)
</pre>

<p>
There is a kinship between the view bound and the upper bound (`CC &lt;: Seq[Int]`) or the lower bound (`T &gt;: Null`).
</p>
</div>
</div>

<div id="outline-container-org46d51c2" class="outline-3">
<h3 id="org46d51c2"><span class="section-number-3">1.4</span> Context Bounds</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Context bounds pose syntactic sugar for having to provide an implicit parameter.
This technique is useful when achieving ad-hoc polymorphism through typeclasses, enabling common interface provisioning to classes which did not declare them.
Typeclasses can be used as bridges as well as adapters.
</p>

<p>
Example:
</p>
<pre class="example">
// without a context bound
def sum[T](list: List[T])(implicit integral: Integral[T]): T = {
    import integral._
    list.foldLeft(integral.zero)(_ + _)
}

// with a context bound
def sum[T: Integral](list: List[T]): T = {
    // You have to refer the implicit.
    val integral = implicitly[Integral[T]]
    import integral._
    list.foldLeft(integral.zero)(_ + _)
}
</pre>

<p>
Context bounds are more useful when you just pass them to other methods which use them.
Example: the `sorted` method on `Seq` needs an implicit `Ordering`.
To create a `reverseSort` method, one could write:
</p>
<pre class="example">
def reverseSort[T: Ordering](seq: Seq[T]) = seq.sorted.reverse
</pre>

<p>
The `Ordering[T]` was implicitly passed using a context bound, it can be as well passed implicitly to `sorted`.
</p>
</div>
</div>

<div id="outline-container-org883ee30" class="outline-3">
<h3 id="org883ee30"><span class="section-number-3">1.5</span> Order of precedence for implicits</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Primary search locations:
</p>

<ul class="org-ul">
<li>Implicits defined in current scope</li>
</ul>
<pre class="example">
implicit val n: Int = 5
def add(x: Int)(implicit y: Int) = x+y
add(5) // 10
</pre>

<ul class="org-ul">
<li>explicit imports</li>
</ul>
<pre class="example">
import scala.collection.JavaConversions.mapAsScalaMap
def env = System.getenv() // Java map
val term = env("TERM") // implicit Java map -&gt; Scala map conversion
</pre>

<ul class="org-ul">
<li>wildcard imports (see the context bound example)</li>
</ul>

<p>
Secondary search locations:
</p>

<ul class="org-ul">
<li>companion objects of a type
<ul class="org-ul">
<li>first, the companion object for the "source" type is looked into. E.g. inside the `object Option` there is an implicit conversion to `Iterable`, so one can call its methods on `Option` or pass `Option` as `Iterable`</li>
</ul></li>
</ul>
<pre class="example">
for {
    x &lt;- List(1, 2, 3)
    y &lt;- Some('x')
} yield (x, y)
// Which desugars into
List(1,2,3).flatMap(x =&gt; Some('x').map(y =&gt; (x, y)))
</pre>
<ul class="org-ul">
<li>`List.flatMap`, however, requires a `TraversableOnce`, which `Option` is not. The compiler then looks for it in the `Option`'s companion object and finds the conversion to `Iterable`.</li>
</ul>
<ul class="org-ul">
<li>second, companion object of the expected type
<ul class="org-ul">
<li>the method `sorted` takes an implicit `Ordering`. In case of `List(1,2,3).sorted`, the compiler looks inside the `object Ordering` and finds an implicit `Ordering[Int]`.</li>
</ul></li>
<li>companion objects of superclasses are also looked into.</li>
</ul>
<ul class="org-ul">
<li>implicit scopes of an argument's type
<ul class="org-ul">
<li>by 'implicit scope' it's meant that all the given rules will be applied to the argument type (its companion object will be searched and so on.).</li>
</ul></li>
<li>implicit scope of type arguments
<ul class="org-ul">
<li>the implicit scope is now the type arguments for given function</li>
</ul></li>
<li>outer objects for nested types</li>
</ul>
<pre class="example">
class A(val n: Int) {
    class B(val m: Int) { require(m &lt; n) }
}

object A {
    implicit def bToString(b: A#B) = "B: %d" format b.m
}

val a = new A(5)
val b = new a.B(3)
val s: String = b // s == "B: 3"
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
